Repository: essicolo/xhydro
Catalog: docs/locales/*/LC_MESSAGES/contributing.po
Languages: fr

source: Contributing
fr: Contribuer

source: Contributions are welcome, and they are greatly appreciated! Every little bit helps, and credit will always be given.
fr: Les contributions sont les bienvenues et sont très appréciées ! Chaque petite contribution est utile, et le crédit sera toujours accordé.

source: You can contribute in many ways:
fr: Vous pouvez contribuer de différentes manières :

source: Types of Contributions
fr: Types de contributions

source: Report Bugs
fr: Signaler les bogues

source: Report bugs at https://github.com/hydrologie/xhydro/issues.
fr: Signalez les bogues à https://github.com/hydrologie/xhydro/issues.

source: If you are reporting a bug, please include:
fr: Si vous signalez un bogue, veuillez inclure :

source: Your operating system name and version.
fr: Le nom et la version de votre système d'exploitation.

source: Any details about your local setup that might be helpful in troubleshooting.
fr: Tout détail sur votre installation locale qui pourrait être utile pour le dépannage.

source: Detailed steps to reproduce the bug.
fr: Etapes détaillées pour reproduire le bogue.

source: Fix Bugs
fr: Corriger un bogue

source: Look through the GitHub issues for bugs. Anything tagged with "bug" and "help wanted" is open to whoever wants to implement it.
fr: Recherchez les bogues dans les problèmes de GitHub. Tout ce qui est étiqueté avec "bug" et "help wanted" est ouvert à quiconque veut l'implémenter.

source: Implement Features
fr: Implémenter des fonctionnalités

source: Look through the GitHub issues for features. Anything tagged with "enhancement" and "help wanted" is open to whoever wants to implement it.
fr: Consultez les questions de GitHub pour trouver des fonctionnalités. Tout ce qui est étiqueté "amélioration" et "aide recherchée" est ouvert à quiconque veut l'implémenter.

source: Write Documentation
fr: Rédiger la documentation

source: xHydro could always use more documentation, whether as part of the official xHydro docs, in docstrings, or even on the web in blog posts, articles, and such.
fr: xHydro pourrait toujours utiliser plus de documentation, que ce soit dans le cadre de la documentation officielle de xHydro, dans les docstrings, ou même sur le web dans des billets de blog, des articles, etc.

source: Submit Feedback
fr: Soumettre un retour d'information

source: The best way to send feedback is to file an issue at https://github.com/hydrologie/xhydro/issues.
fr: La meilleure façon d'envoyer un retour d'information est de déposer un problème à l'adresse https://github.com/hydrologie/xhydro/issues.

source: If you are proposing a feature:
fr: Si vous proposez une fonctionnalité :

source: Explain in detail how it would work.
fr: Expliquez en détail comment cela fonctionnerait.

source: Keep the scope as narrow as possible, to make it easier to implement.
fr: Le champ d'application doit être aussi restreint que possible, afin de faciliter la mise en œuvre.

source: Remember that this is a volunteer-driven project, and that contributions are welcome :)
fr: N'oubliez pas qu'il s'agit d'un projet mené par des personnes volontaires et que les contributions sont les bienvenues :)

source: Get Started!
fr: Démarrer !

source: If you are new to using GitHub and `git`, please read `this guide <https://guides.github.com/activities/hello-world/>`_ first.
fr: Si vous n'avez jamais utilisé GitHub et `git`, veuillez d'abord lire `ce guide <https://guides.github.com/activities/hello-world/>`_.

source: Anaconda Python users: Due to the complexity of some packages, the default dependency solver can take a long time to resolve the environment. Consider running the following commands in order to speed up the process::
fr: Utilisateurs d'Anaconda Python : En raison de la complexité de certains paquets, le résolveur de dépendances par défaut peut prendre beaucoup de temps pour résoudre l'environnement. Envisagez d'exécuter les commandes suivantes afin d'accélérer le processus ::

source: For more information, please see the following link: https://www.anaconda.com/blog/a-faster-conda-for-a-growing-community
fr: Pour plus d'informations, veuillez consulter le lien suivant : https://www.anaconda.com/blog/a-faster-conda-for-a-growing-community

source: Alternatively, you can use the `mamba <https://mamba.readthedocs.io/en/latest/index.html>`_ package manager, which is a drop-in replacement for ``conda``. If you are already using `mamba`, replace the following commands with ``mamba`` instead of ``conda``.
fr: Alternativement, vous pouvez utiliser le gestionnaire de paquets `mamba <https://mamba.readthedocs.io/en/latest/index.html>`_, qui est un remplacement direct de ``conda``. Si vous utilisez déjà ``mamba``, remplacez les commandes suivantes par ``mamba`` au lieu de ``conda``.

source: Ready to contribute? Here's how to set up ``xhydro`` for local development.
fr: Prêt à contribuer ? Voici comment mettre en place ``xhydro`` pour le développement local.

source: If you are not already an `xhydro` collaborator, fork the ``xhydro`` repo on GitHub.
fr: Si vous n'êtes pas encore un collaborateur de `xhydro`, créez un embranchement sur le dépôt ``xhydro`` sur GitHub.

source: Clone your fork locally::
fr: Clonez votre embranchement localement ::

source: Install your local copy into a development environment. You can create a new Anaconda development environment with::
fr: Installez votre copie locale dans un environnement de développement. Vous pouvez créer un nouvel environnement de développement Anaconda avec ::

source: This installs ``xhydro`` in an "editable" state, meaning that changes to the code are immediately seen by the environment.
fr: Cela installe ``xhydro`` dans un état "éditable", ce qui signifie que les changements apportés au code sont immédiatement vus par l'environnement.

source: To ensure a consistent coding style, install the ``pre-commit`` hooks to your local clone::
fr: Pour assurer un style de codage cohérent, installez les hooks ``pre-commit`` dans votre clone local ::

source: On commit, ``pre-commit`` will check that ``black``, ``blackdoc``, ``isort``, ``flake8``, and ``ruff`` checks are passing, perform automatic fixes if possible, and warn of violations that require intervention. If your commit fails the checks initially, simply fix the errors, re-add the files, and re-commit.
fr: Lors de la livraison, ``pre-commit`` vérifiera que les contrôles ``black``, ``blackdoc``, ``isort`, ``flake8``, et ``ruff`` passent, effectuera des corrections automatiques si possible, et avertira des violations qui nécessitent une intervention. Si votre livraison échoue aux vérifications initiales, corrigez simplement les erreurs, ajoutez à nouveau les fichiers, et effectuez une nouvelle livraison.

source: You can also run the hooks manually with::
fr: Vous pouvez également exécuter les crochets manuellement avec ::

source: If you want to skip the ``pre-commit`` hooks temporarily, you can pass the ``--no-verify`` flag to `$ git commit`.
fr: Si vous voulez ignorer temporairement les crochets ``pre-commit``, vous pouvez passer l'argument ``-no-verify`` à `$ git commit`.

source: Create a branch for local development::
fr: Créer une branche pour le développement local ::

source: Now you can make your changes locally.
fr: Vous pouvez maintenant effectuer vos modifications localement.

source: When you're done making changes, we **strongly** suggest running the tests in your environment or with the help of ``tox``::
fr: Lorsque vous avez terminé les changements, nous suggérons **fortement** d'exécuter les tests dans votre environnement ou avec l'aide de ``tox`` ::

source: Commit your changes and push your branch to GitHub::
fr: Validez vos modifications et envoyez votre branche sur GitHub ::

source: If ``pre-commit`` hooks fail, try re-committing your changes (or, if need be, you can skip them with `$ git commit --no-verify`).
fr: Si les crochets ``pre-commit`` échouent, essayez de re-commettre vos changements (ou, si nécessaire, vous pouvez les ignorer avec `$ git commit --no-verify`).

source: Submit a `Pull Request <https://docs.github.com/en/pull-requests/collaborating-with-pull-requests/proposing-changes-to-your-work-with-pull-requests/creating-a-pull-request>`_ through the GitHub website.
fr: Soumettez une `Pull Request <https://docs.github.com/en/pull-requests/collaborating-with-pull-requests/proposing-changes-to-your-work-with-pull-requests/creating-a-pull-request>`_ via le site GitHub.

source: When pushing your changes to your branch on GitHub, the documentation will automatically be tested to reflect the changes in your Pull Request. This build process can take several minutes at times. If you are actively making changes that affect the documentation and wish to save time, you can compile and test your changes beforehand locally with::
fr: Lorsque vous apportez vos modifications à votre branche sur GitHub, la documentation sera automatiquement testée pour refléter les modifications de votre Pull Request. Ce processus de compilation peut parfois prendre plusieurs minutes. Si vous êtes en train de faire des changements qui affectent la documentation et que vous souhaitez gagner du temps, vous pouvez compiler et tester vos changements localement avec ::

source: Once your Pull Request has been accepted and merged to the ``main`` branch, several automated workflows will be triggered:
fr: Une fois que votre Pull Request a été acceptée et fusionnée dans la branche ``main``, plusieurs flux de travail automatisés seront déclenchés :

source: The ``bump-version.yml`` workflow will automatically bump the patch version when pull requests are pushed to the ``main`` branch on GitHub. **It is not recommended to manually bump the version in your branch when merging (non-release) pull requests (this will cause the version to be bumped twice).**
fr: Le flux de travail ``bump-version.yml`` augmentera automatiquement la version du patch lorsque les demandes d'extraction sont poussées vers la branche ``main`` sur GitHub. **Il n'est pas recommandé d'augmenter manuellement la version de votre branche lorsque vous fusionnez des demandes d'extraction (qui ne sont pas des versions) (cela entraînera une double augmentation de la version).**

source: `ReadTheDocs` will automatically build the documentation and publish it to the `latest` branch of `xhydro` documentation website.
fr: `ReadTheDocs` construira automatiquement la documentation et la publiera sur la branche `latest` du site de documentation `xhydro`.

source: If your branch is not a fork (ie: you are a maintainer), your branch will be automatically deleted.
fr: Si votre branche n'est pas un embranchement (ie : vous êtes un mainteneur), votre branche sera automatiquement supprimée.

source: You will have contributed your first changes to ``xhydro``!
fr: Vous aurez contribué à vos premiers changements dans ``xhydro`` !

source: Pull Request Guidelines
fr: Lignes directrices pour les demandes de tirage (pull request)

source: Before you submit a pull request, check that it meets these guidelines:
fr: Avant de soumettre une demande de tirage, vérifiez qu'elle respecte ces directives :

source: The pull request should include tests and should aim to provide `code coverage <https://en.wikipedia.org/wiki/Code_coverage>`_ for all new lines of code. You can use the ``--cov-report html --cov xhydro`` flags during the call to ``pytest`` to generate an HTML report and analyse the current test coverage.
fr: La pull request doit inclure des tests et doit viser à fournir une `couverture de code <https://en.wikipedia.org/wiki/Code_coverage>`_ pour toutes les nouvelles lignes de code. Vous pouvez utiliser les drapeaux ``--cov-report html --cov xhydro`` lors de l'appel à ``pytest`` pour générer un rapport HTML et analyser la couverture actuelle des tests.

source: If the pull request adds functionality, the docs should also be updated. Put your new functionality into a function with a docstring, and add the feature to the list in ``README.rst``.
fr: Si la pull request ajoute une fonctionnalité, la documentation doit aussi être mise à jour. Mettez votre nouvelle fonctionnalité dans une fonction avec une docstring, et ajoutez la fonctionnalité à la liste dans ``README.rst``.

source: The pull request should work for Python 3.9, 3.10, and 3.11. Check that the tests pass for all supported Python versions.
fr: La pull request devrait fonctionner pour Python 3.9, 3.10, et 3.11. Vérifiez que les tests passent pour toutes les versions de Python supportées.

source: Tips
fr: Conseils

source: To run a subset of tests::
fr: Pour exécuter un sous-ensemble de tests ::

source: To run specific code style checks::
fr: Pour effectuer des contrôles de style de code spécifiques ::

source: To get ``black``, ``isort ``blackdoc``, ``ruff``, and ``flake8`` (with plugins ``flake8-alphabetize`` and ``flake8-rst-docstrings``) simply install them with ``pip`` (or ``conda``) into your environment.
fr: Pour obtenir ``black``, ``isort``, ``blackdoc``, ``ruff``, et ``flake8`` (avec les plugins ``flake8-alphabetize`` et ``flake8-rst-docstrings``), installez-les simplement avec ``pip`` (ou ``conda``) dans votre environnement.

source: Versioning/Tagging
fr: Versionnement / marquage

source: A reminder for the **maintainers** on how to deploy. This section is only relevant when producing a new point release for the package.
fr: Un rappel pour les **mainteneurs** sur la façon de déployer. Cette section n'est pertinente que lors de la production d'une nouvelle version du paquet.

source: It is important to be aware that any changes to files found within the ``xhydro`` folder (with the exception of ``xhydro/__init__.py``) will trigger the ``bump-version.yml`` workflow. Be careful not to commit changes to files in this folder when preparing a new release.
fr: Il est important d'être conscient que toute modification des fichiers se trouvant dans le dossier ``xhydro`` (à l'exception de ``xhydro/__init__.py``) déclenchera le flux de travail ``bump-version.yml``. Faites attention à ne pas modifier les fichiers de ce dossier lors de la préparation d'une nouvelle version.

source: Create a new branch from `main` (e.g. `release-0.2.0`).
fr: Créer une nouvelle branche à partir de `main` (par exemple `release-0.2.0`).

source: Update the `CHANGELOG.rst` file to change the `Unreleased` section to the current date.
fr: Mettre à jour le fichier `CHANGELOG.rst` pour changer la section `Unreleased` à la date actuelle.

source: Bump the version in your branch to the next version (e.g. `v0.1.0 -> v0.2.0`):
fr: Passer la version de votre branche à la version suivante (par exemple `v0.1.0 -> v0.2.0`) :

source: Create a pull request from your branch to `main`.
fr: Créez une demande de tirage depuis votre branche vers `main`.

source: Once the pull request is merged, create a new release on GitHub. On the main branch, run:
fr: Une fois la demande de tirage fusionnée, créez une nouvelle version sur GitHub. Sur la branche principale, exécutez :

source: This will trigger a GitHub workflow to build the package and upload it to TestPyPI. At the same time, the GitHub workflow will create a draft release on GitHub. Assuming that the workflow passes, the final release can then be published on GitHub by finalizing the draft release.
fr: Cela déclenchera un flux de travail GitHub pour construire le paquetage et le télécharger sur TestPyPI. En même temps, le flux de travail GitHub créera une version préliminaire sur GitHub. En supposant que le flux de travail passe, la version finale peut alors être publiée sur GitHub en finalisant la version préliminaire.

source: Once the release is published, the `publish-pypi.yml` workflow will go into an `awaiting approval` mode on Github Actions. Only authorized users may approve this workflow (notifications will be sent) to trigger the upload to PyPI.
fr: Une fois la version publiée, le flux de travail `publish-pypi.yml` passera en mode `awaiting approval` sur Github Actions. Seuls les utilisateurs autorisés peuvent approuver ce workflow (des notifications seront envoyées) pour déclencher le téléchargement vers PyPI.

source: To generate the release notes, run:
fr: Pour générer les notes de mise à jour, exécutez :

source: This will print the release notes (taken from the `HISTORY.rst` file) to your python console. Copy and paste them into the GitHub release description, keeping only the changes for the current version.
fr: Cela imprimera les notes de version (extraites du fichier `HISTORY.rst`) dans votre console python. Copiez et collez-les dans la description de la version de GitHub, en ne gardant que les changements pour la version actuelle.

source: Once the release is published, it will go into a `staging` mode on Github Actions. Once the tests pass, admins can approve the release (an e-mail will be sent) and it will be published on PyPI.
fr: Une fois la version publiée, elle passera en mode `staging` sur Github Actions. Une fois les tests passés, les administrateurs peuvent approuver la version (un e-mail sera envoyé) et elle sera publiée sur PyPI.

source: Uploads to PyPI can **never** be overwritten. If you make a mistake, you will need to bump the version and re-release the package. If the package uploaded to PyPI is broken, you should modify the GitHub release to mark the package as broken, as well as yank the package (mark the version "broken") on PyPI.
fr: Les téléchargements sur PyPI ne peuvent **jamais** être écrasés. Si vous faites une erreur, vous devrez modifier la version et publier à nouveau le paquet. Si le paquet téléchargé sur PyPI est cassé, vous devez modifier la version GitHub pour marquer le paquet comme cassé, ainsi que retirer le paquet (marquer la version "cassée") sur PyPI.

source: Packaging
fr: Création d'un paquet

source: When a new version has been minted (features have been successfully integrated test coverage and stability is adequate), maintainers should update the pip-installable package (wheel and source release) on PyPI as well as the binary on conda-forge.
fr: Lorsqu'une nouvelle version a été créée (les fonctionnalités ont été intégrées avec succès, la couverture des tests et la stabilité sont adéquates), les mainteneurs doivent mettre à jour le paquetage installable par pip (wheel et version source) sur PyPI ainsi que le binaire sur conda-forge.

source: The simple approach
fr: L'approche simple

source: The simplest approach to packaging for general support (pip wheels) requires that ``flit`` be installed::
fr: L'approche la plus simple de l'empaquetage pour le support général (pip wheels) requiert que ``flit`` soit installé ::

source: From the command line on your Linux distribution, simply run the following from the clone's main dev branch::
fr: À partir de la ligne de commande de votre distribution Linux, exécutez simplement ce qui suit à partir de la branche principale de développement du clone ::

source: The new version based off of the version checked out will now be available via `pip` (`$ pip install xhydro`).
fr: La nouvelle version basée sur la version extraite sera maintenant disponible via `pip` (`$ pip install xhydro`).

source: Releasing on conda-forge
fr: Publication sur conda-forge

source: Initial Release
fr: Première publication

source: Before preparing an initial release on conda-forge, we *strongly* suggest consulting the following links:
fr: Avant de préparer une version initiale sur conda-forge, nous suggérons *fortement* de consulter les liens (en anglais) suivants :

source: In order to create a new conda build recipe, to be used when proposing packages to the conda-forge repository, we strongly suggest using the ``grayskull`` tool::
fr: Afin de créer une nouvelle recette de construction conda, qui sera utilisée pour proposer des paquets au dépôt conda-forge, nous suggérons fortement d'utiliser l'outil ``grayskull`` ::

source: For more information on ``grayskull``, please see the following link: https://github.com/conda/grayskull
fr: Pour plus d'informations sur ``grayskull``, veuillez consulter le lien suivant : https://github.com/conda/grayskull

source: Before updating the main conda-forge recipe, we echo the conda-forge documentation and *strongly* suggest performing the following checks:
fr: Avant de mettre à jour la recette principale de conda-forge, nous faisons écho à la documentation de conda-forge et suggérons *fortement* d'effectuer les vérifications suivantes :

source: Ensure that dependencies and dependency versions correspond with those of the tagged version, with open or pinned versions for the `host` requirements.
fr: S'assurer que les dépendances et les versions des dépendances correspondent à celles de la version étiquetée, avec des versions ouvertes ou épinglées pour les exigences `host`.

source: If possible, configure tests within the conda-forge build CI (e.g. `imports: xhydro`, `commands: pytest xhydro`).
fr: Si possible, configurez les tests dans le CI de construction de conda-forge (par exemple `imports: xhydro`, `commands: pytest xhydro`).

source: Subsequent releases
fr: Publications ultérieures

source: If the conda-forge feedstock recipe is built from PyPI, then when a new release is published on PyPI, `regro-cf-autotick-bot` will open Pull Requests automatically on the conda-forge feedstock. It is up to the conda-forge feedstock maintainers to verify that the package is building properly before merging the Pull Request to the main branch.
fr: Si la recette du feedstock conda-forge est construite à partir de PyPI, alors quand une nouvelle version est publiée sur PyPI, `regro-cf-autotick-bot` ouvrira automatiquement des Pull Requests sur le feedstock conda-forge. C'est aux mainteneurs du feedstock conda-forge de vérifier que le paquet se construit correctement avant de fusionner la Pull Request à la branche principale.

source: Building sources for wide support with `manylinux` image
fr: Construction des sources pour un support étendu avec l'image `manylinux`

source: This section is for building source files that link to or provide links to C/C++ dependencies. It is not necessary to perform the following when building pure Python packages.
fr: Cette section concerne la construction de fichiers sources qui renvoient ou fournissent des liens vers des dépendances C/C++. Il n'est pas nécessaire d'effectuer les opérations suivantes lors de la construction de paquets Python purs.

source: In order to do ensure best compatibility across architectures, we suggest building wheels using the `PyPA`'s `manylinux` docker images (at time of writing, we endorse using `manylinux_2_24_x86_64`).
fr: Afin d'assurer une meilleure compatibilité entre les architectures, nous suggérons de construire les roues en utilisant les images docker `PyPA` `manylinux` (au moment de la rédaction, nous recommandons d'utiliser `manylinux_2_24_x86_64`).

source: With `docker` installed and running, begin by pulling the image::
fr: Avec `docker` installé et en cours d'exécution, commencez par extraire l'image ::

source: From the xhydro source folder we can enter into the docker container, providing access to the `xhydro` source files by linking them to the running image::
fr: Depuis le dossier source de xhydro, nous pouvons entrer dans le conteneur docker, ce qui permet d'accéder aux fichiers source `xhydro` en les liant à l'image en cours d'exécution ::

source: Finally, to build the wheel, we run it against the provided Python3.9 binary::
fr: Enfin, pour construire la roue, nous l'exécutons en utilisant le programme Python3.9 fourni ::
