Repository: essicolo/xhydro
Catalog: docs/locales/*/LC_MESSAGES/contributing.po
Languages: fr

source: This will then place two files in `xhydro/dist/` ("xhydro-1.2.3-py3-none-any.whl" and "xhydro-1.2.3.tar.gz"). We can now leave our docker container (`$ exit`) and continue with uploading the files to PyPI::
fr: Cela placera deux fichiers dans `xhydro/dist/` ("xhydro-1.2.3-py3-none-any.whl" et "xhydro-1.2.3.tar.gz"). Nous pouvons maintenant quitter notre conteneur docker (`$ exit`) et continuer à télécharger les fichiers sur PyPI ::
